# Python

> 网易云课堂，小蚊子

## 3W2H：what, who, why, how, how continue
## 安装Anaconda
### 使用spyder

+ 数据类型
+ 命名规则
+ 运算

In [2]:
print(1 and 2, 2 or 0, not 1)

2 2 False

In [3]:
s = 'ILovePython'

In [6]:
try:
    s[0] = 'm'
except:
    print(s[0])
finally:
    s[0] == 'm'

I

In [14]:
# startswith first arg must be str or a tuple of str, not list
s.startswith(('I','P'))

True

In [18]:
s.find('Love')

1

In [20]:
import re
pattern = re.compile('P')
pattern.findall(s)

['P']

In [22]:
re.findall(pattern, s)

['P']

In [23]:
s.replace('P','O')

'ILoveOython'

In [24]:
re.sub('Python','Cpython',s)

'ILoveCpython'

In [25]:
l = list(s)

In [26]:
l

['I', 'L', 'o', 'v', 'e', 'P', 'y', 't', 'h', 'o', 'n']

In [27]:
''.join(l)

'ILovePython'

In [28]:
' '.join(l)

'I L o v e P y t h o n'

In [32]:
set(l)

{'I', 'L', 'P', 'e', 'h', 'n', 'o', 't', 'v', 'y'}

In [38]:
set(['P','h']) <= set(l)

True

In [39]:
'P' in l

True

In [37]:
set([25,100]) <= set(range(101))

True

+ pandas
    + Series
    + DataFrame

In [41]:
import pandas as pd

In [42]:
df = pd.DataFrame({'name':['suai','nam'],'age':[18,29]})
df

   age  name
0   18  suai
1   29   nam

In [43]:
df['name']

0    suai
1     nam
Name: name, dtype: object

In [44]:
df.name

0    suai
1     nam
Name: name, dtype: object

In [45]:
df[:1]

   age  name
0   18  suai

In [50]:
df.iloc[0:1,0:1]

   age
0   18

In [51]:
df.iloc[1,1]

'nam'

In [52]:
df.at[0,'name']

'suai'

In [53]:
df.columns

Index(['age', 'name'], dtype='object')

In [54]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [55]:
df.columns=['age2', 'name2']

In [56]:
df

   age2 name2
0    18  suai
1    29   nam

In [59]:
import numpy as np
df.index = np.arange(4,6)

In [60]:
df

   age2 name2
4    18  suai
5    29   nam

In [67]:
df

   age2 name2
4    18  suai
5    29   nam

In [68]:
df.drop(4)

   age2 name2
5    29   nam

In [69]:
df

   age2 name2
4    18  suai
5    29   nam

In [70]:
del df['age2']

In [71]:
df

  name2
4  suai
5   nam

In [74]:
df.loc[len(df)+3] = 'zhang'

In [75]:
df

   name2
4   suai
5  zhang

In [78]:
df['newcl'] = ['ls','ww']

In [79]:
df

   name2 newcl
4   suai    ls
5  zhang    ww